{
    "Position": "SENIOR ACCOUNTANT",
    "skills": "Payroll Tax Returns, Income Tax Returns, Bank Reconciliations, Credit Card Statement Reconciliations, Financial Statements, Financial Packages, Sales Tax Returns, Quarterly Payroll Returns, Daily Accounting, Bookkeeping, QuickBooks, Balance Sheet Reconciliations, Trial Balance Reconciliations, GL Entries, Financial Data Integrity, Cash Auditing, Credit Card Payment Auditing, CRM System, Inventory Auditing, Contract Management, Monthly Close Process, Revenue Cycle Reporting, Revenue Recognition (ASC 606), Excel, Adaptive, Volume Reporting, Contractual Allowance Verification, Ad Hoc Reporting, Financial Planning & Analysis, Annual Budget Preparation, Database Management, Relational Database Management, Performance Monitoring",
    "summary": "",
    "work_experience": "As a Senior Accountant from 01/2019 to Current, this individual works with business clients on payroll and income tax returns, performs monthly bank and credit card reconciliations, sets up tax accounts, processes payroll, files sales tax returns, prepares financial statements and packages, assists with funding, develops annual budgets, manages daily accounting in QuickBooks, acts as a Lead Accountant, sets up loans, and handles various reconciliations and payroll filings. Previously, as a Senior Accountant/Financial Analyst from 06/2017 to 01/2019, they maintained financial statements in QuickBooks for 6 entities, managed the full accounting cycle, made GL entries, ensured data accuracy, audited payments and inventory, tracked activities using CRM, and completed monthly close processes. From 08/2016 to 05/2017, as a Revenue Cycle Analyst, they calculated and reported volumes, verified contractual allowances, managed ad hoc reporting, conducted financial planning for expansion, reported to the VP of Revenue Cycle, ensured ASC 606 compliance, and built custom reports in Excel and Adaptive. As a Financial Analyst from 03/2015 to 07/2016, they supported management with financial reporting, monitored performance, tracked revenue recovery, collaborated on improvements, prepared annual budgets, and managed databases for revenue accuracy and compliance."
}