{
    "Position": "SENIOR ACCOUNTANT",
    "skills": "Payroll, & Tax 940, 941, withholdingAccounting, Accounts Payabk & Receivable, Multi-State Sales Tax Filing, Analytical reasoning, Account reconciliation expert, Strength in regulatory reporting, Adobe, Sage, PeachTree, Quick Books, MS Office, Medlin, Tax Slayer, Pro Series, Lotus",
    "summary": "11 + years experience in the accounting profession. Bachelors Degree - in Accounting and studying for CPA license. Managed tax preparation and filing for 25 diverse companies such as sole proprietors, corporations, s-corps, partnership, non-profit organization in Prsliaeliician@ine(isiy cy for 10 different states. Results-oriented Accountant skilled in regulatory reporting, tax accounting operations with ane xtensive knowkdge of Blsse nin ieee tien heme) ee escoce",
    "work_experience": "This individual's career spans from January 2002 to the present, encompassing roles as Accountant, Accounts Receivable & Collection Manager, Senior Accountant, and Accountants Payable/Receivable & Purchasing Administrator. \n\nFrom 01/2002 to 01/2011, and again from 01/2011 to 01/2012, as an Accountant at Company Name i'% City, State and Company Nan 1% City , State respectively, responsibilities included preparing payroll, sales and use tax, employment taxes, employer taxes, W-2, and annual reports. They managed two separate entities (corporation and proprietorship), transformed companies into a positive financial standing, and implemented modern tax & accounting software such as QuickBooks, Peachtree, and Payroll Mate to increase office productivity.\n\nAs Accounts Receivable & Collection Manager from 01/2010 to 01/2011 at Company Name 1% City , State, key achievements included successfully collecting and depositing $1,200,000.00 of outstanding debt, amending incorrect corporate, multi-state sales and use tax returns for 3 different entities, restructuring and managing accounts receivable billing processes, resolving discrepancies between financial, budgetary transactions, and filing bond claims with Surety Company on defaulted contracts.\n\nFrom 01/2011 to Current, serving as Senior Accountant at Company Name 1% City , State, they successfully negotiated a settlement with the NC State Revenue Dept., reconciled 6 years of tax returns for Performance Motorcycle shop, and managed payroll and tax needs for 10 business accounts and 30 individual clients.\n\nConcurrently, as Accountants Payable/Receivable & Purchasing Administrator from 01/2012 to Current at Company Name 1% City , State, duties involved auditing credit card bills and transactions, processing check requests & cash receipts, preparing and filing monthly multi-state sales and use tax returns, matching check invoices, obtaining signatures for disbursements & bank transfers, reconciling vendor statements, maintaining consignment accounts, assisting with purchasing & inventory management, and setting up new customer accounts.\n\nOverall accomplishments include conducting detailed technical and analytical reviews of federal/state corporate, partnership and S corporation tax returns for Fortune 500 companies, maintaining accurate accounts (cash, inventory, prepaid, fixed assets, accounts payable, accrued expenses, line of credit), streamlining accounting and billing activities, and gaining extensive experience with Financial Statements audits, reviews, compilations and audits for Governmental organizations, resulting in savings of over $20,000 from a Worker's Compensation Insurance, Sales and Use Tax Audit."
}