{
    "Position": "ACCOUNTANT",
    "skills": "General accounting procedures, Accounts Payables, Costing, Billing & Accounts Receivables, Cash Management, Bank Reconciliation, Payroll Management, Finalisation of accounts up to Balance Sheet, Accounting Reports Management, Knowledge of L/C Documentation, Admin & Secretarial Skills, Competencies Proficient in data entry and management, Ability to maintain a high level of accuracy in preparing and entering financial information, Ability to work fast and in an accurate manner, Good organizational and analytical skills, Ability to learn and adapt quickly to meet changing needs, Sound knowledge of computer accounting programs (I-Travel Financials (ERP), MYOB, Tally, QuickBooks, Xpert, Leap Accounting), MS Office applications (Word, Excel, PowerPoint, Outlook), Internet applications, Very good typing speed",
    "summary": "General accounting procedures ***Accounts Payables * Costing ** Billng & Accounts Receivables * Cash Management * Bank Reconciliation\n***Payroll Management * Finalisation of accounts up to Balance Sheet * Accounting Reports Management * Knowledge of L/C Documentation\n* Admin & Secretarial Skills Competencies Proficient in data entry and management * Ability to maintain a high level of accuracy in preparing and\nentering financial information * Ability to work fast and in an accurate manner * Good organizational and analytical skills * Ability to eam and\nadapt quickly to meet changing needs",
    "work_experience": "This professional accumulated diverse accounting experience from July 2008 to October 2014, progressing from Junior Accountant to Accountant. Key roles included managing high volumes of accounts payables and receivables, performing bank and account reconciliations, and processing various payments using cheques, telegraphic, and online transfers. They demonstrated proficiency in managing cash receipts, petty cash, payroll, and statutory payments, while also preparing month-end financial reports, assisting with annual audits, and utilizing software like Leap Accounting and MYOB."
}